Repository: rahmatullahboss/hotel
Catalog: apps/mobile-flutter/lib/l10n/app_*.arb
Languages: bn

# appTitle
source: Zinu Rooms
bn: জিনু রুমস

source: Home
bn: হোম

source: Search
bn: সার্চ

source: Bookings
bn: বুকিং

source: Profile
bn: প্রোফাইল

# greeting
source: Hello
bn: হ্যালো

# findPerfectStay
source: Find your perfect stay
bn: আপনার পছন্দের হোটেল খুঁজুন

# searchHint
source: Search hotels or cities...
bn: হোটেল বা শহর খুঁজুন...

source: Popular Destinations
bn: জনপ্রিয় গন্তব্য

source: Featured Hotels
bn: বিশেষ হোটেল

source: View All
bn: সব দেখুন

source: Check-in
bn: চেক-ইন

source: Check-out
bn: চেক-আউট

source: Guests
bn: অতিথি

source: Rooms
bn: রুম

source: Book Now
bn: এখনই বুক করুন

source: per night
bn: প্রতি রাতে

source: reviews
bn: রিভিউ

source: My Bookings
bn: আমার বুকিং

source: Upcoming
bn: আসন্ন

source: Completed
bn: সম্পন্ন

source: Cancelled
bn: বাতিল

# noBookings
source: No bookings yet
bn: কোনো বুকিং নেই

source: Booking Confirmed!
bn: বুকিং সম্পন্ন!

source: Notifications
bn: নোটিফিকেশন

source: No notifications
bn: কোনো নোটিফিকেশন নেই

source: Edit Profile
bn: প্রোফাইল এডিট

source: Name
bn: নাম

source: Email
bn: ইমেইল

source: Phone
bn: ফোন

source: Save
bn: সেভ করুন

source: Settings
bn: সেটিংস

source: Dark Mode
bn: ডার্ক মোড

source: Language
bn: ভাষা

source: English
bn: ইংরেজি

source: Bengali
bn: বাংলা

source: Login
bn: লগইন

source: Logout
bn: লগআউট

source: Register
bn: রেজিস্টার

source: Retry
bn: পুনরায় চেষ্টা করুন

# loadError
source: Failed to load. Please try again.
bn: লোড করতে সমস্যা হয়েছে। আবার চেষ্টা করুন।

# noResults
source: No results found
bn: কোনো ফলাফল পাওয়া যায়নি

source: Account
bn: অ্যাকাউন্ট

source: QR Scan
bn: QR স্ক্যান

# bookingsAndTrips
source: Bookings & Trips
bn: বুকিং ও ভ্রমণ

source: My Trips
bn: আমার ট্রিপ

source: Saved Hotels
bn: সেভ করা হোটেল

# walletAndRewards
source: Wallet & Rewards
bn: ওয়ালেট ও রিওয়ার্ড

source: Wallet
bn: ওয়ালেট

source: Referral
bn: রেফারেল

source: Achievements
bn: অ্যাচিভমেন্ট

# offersAndRewards
source: Offers & Rewards
bn: অফার ও রিওয়ার্ড

source: Preferences
bn: পছন্দসমূহ

source: Help
bn: সাহায্য

# helpAndSupport
source: Help & Support
bn: সাহায্য ও সাপোর্ট

source: Points
bn: পয়েন্ট

source: Guest User
bn: অতিথি ব্যবহারকারী

source: User
bn: ব্যবহারকারী

# loginPrompt
source: Login to access all features
bn: লগইন করুন সব ফিচার ব্যবহার করতে

# homeGreeting
source: Welcome! 👋
bn: স্বাগতম! 👋

# whereToStay
source: Where will you stay today?
bn: আজকে কোথায় থাকবেন?

source: First Booking Offer!
bn: প্রথম বুকিং অফার!

# firstBookingDiscount
source: Get 20% off your first stay
bn: প্রথম থাকায় ২০% ছাড় পান

source: Limited Offer
bn: সীমিত অফার

source: Book
bn: বুক করুন

source: Popular Hotels
bn: জনপ্রিয় হোটেল

source: No hotels found
bn: কোনো হোটেল পাওয়া যায়নি

# filterNearby
source: Nearby
bn: কাছে

# filterBudget
source: Budget
bn: বাজেট

# filterLuxury
source: Luxury
bn: প্রিমিয়াম

# filterCouple
source: Couple
bn: কাপল

# cityDhaka
source: Dhaka
bn: ঢাকা

# cityChittagong
source: Chittagong
bn: চট্টগ্রাম

# cityCoxsBazar
source: Cox's Bazar
bn: কক্সবাজার

# citySylhet
source: Sylhet
bn: সিলেট

# cityRajshahi
source: Rajshahi
bn: রাজশাহী

# cityKhulna
source: Khulna
bn: খুলনা

# navHome
source: Home
bn: হোম

# navSearch
source: Search
bn: সার্চ

# navBookings
source: Bookings
bn: বুকিং

# navProfile
source: Profile
bn: প্রোফাইল

# searchPlaceholder
source: Search hotels or city...
bn: হোটেল বা শহর খুঁজুন...

# hotelCountSuffix
source: Hotels
bn: হোটেল

# filterTitle
source: Filters
bn: ফিল্টার

# filterClearAll
source: Clear All
bn: সব মুছুন

# filterPriceRange
source: Price Range
bn: মূল্য সীমা

# filterMinRating
source: Min Rating
bn: ন্যূনতম রেটিং

# filterAmenities
source: Amenities
bn: সুবিধাসমূহ

# filterCity
source: City
bn: শহর

# filterApply
source: Apply Filters
bn: ফিল্টার প্রয়োগ করুন

# amenityWifi
source: WiFi
bn: ওয়াইফাই

# amenityAC
source: AC
bn: এসি

# amenityTV
source: TV
bn: টিভি

# amenityParking
source: Parking
bn: পার্কিং

# amenityPool
source: Pool
bn: পুল

# amenityRestaurant
source: Restaurant
bn: রেস্তোরাঁ

# amenityGym
source: Gym
bn: জিম

# amenityRoomService
source: Room Service
bn: রুম সার্ভিস

# searchHeaderTitle
source: Search
bn: সার্চ করুন

# searchHeaderSubtitle
source: Find your favorite hotel
bn: আপনার পছন্দের হোটেল খুঁজুন

# searchSuggestions
source: Suggestions
bn: সাজেশন

# searchPopularDestinations
source: Popular Destinations
bn: জনপ্রিয় গন্তব্য

# searchAllHotels
source: View All Hotels
bn: সব হোটেল দেখুন

# searchTipsTitle
source: Search Tips
bn: সার্চ টিপস

# searchTipNearMe
source: Use "Near Me" to find nearby hotels
bn: "Near Me" দিয়ে কাছের হোটেল খুঁজুন

# searchTipBudget
source: Filter by Budget (≤৳3000) or Premium (≥৳8000)
bn: বাজেট (≤৳৩০০০) বা প্রিমিয়াম (≥৳৮০০০) দিয়ে ফিল্টার করুন

# searchResultsError
source: Problem searching
bn: সার্চ করতে সমস্যা হয়েছে

# searchClear
source: Clear
bn: মুছুন

# searchLocationFound
source: Location found
bn: লোকেশন পাওয়া গেছে

# searchLocationError
source: Location service disabled
bn: লোকেশন সার্ভিস বন্ধ আছে

# searchTryAgain
source: Try Again
bn: আবার চেষ্টা করুন

# bookingsTitle
source: My Bookings
bn: আমার বুকিং

# bookingsSubtitleSuffix
source: bookings found
bn: টি বুকিং পাওয়া গেছে

# tabUpcoming
source: Upcoming
bn: আসন্ন

# tabCompleted
source: Completed
bn: সম্পন্ন

# tabCancelled
source: Cancelled
bn: বাতিল

# emptyUpcomingTitle
source: No Upcoming Bookings
bn: কোন আসন্ন বুকিং নেই

# emptyUpcomingSubtitle
source: You don't have any upcoming trips planned.
bn: আপনার কোনো আসন্ন ভ্রমণের পরিকল্পনা নেই।

# emptyCompletedTitle
source: No Completed Bookings
bn: কোন সম্পন্ন বুকিং নেই

# emptyCompletedSubtitle
source: You haven't completed any trips yet.
bn: আপনি এখনও কোনো ভ্রমণ সম্পন্ন করেননি।

# emptyCancelledTitle
source: No Cancelled Bookings
bn: কোন বাতিল বুকিং নেই

# emptyCancelledSubtitle
source: You have no cancelled bookings.
bn: আপনার কোনো বাতিল বুকিং নেই।

# findHotelsButton
source: Find Hotels
bn: হোটেল খুঁজুন

# loginWelcome
source: Welcome!
bn: স্বাগতম!

# loginSubtitle
source: Login to your account
bn: লগইন করুন আপনার অ্যাকাউন্টে

# googleLogin
source: Login with Google
bn: Google দিয়ে লগইন করুন

# orDivider
source: OR
bn: অথবা

# phoneInputLabel
source: Phone Number / Email
bn: ফোন নম্বর / ইমেইল

# passwordInputLabel
source: Password
bn: পাসওয়ার্ড

# loginButton
source: Login
bn: লগইন করুন

source: Forgot Password?
bn: পাসওয়ার্ড ভুলে গেছেন?

# noAccount
source: Don't have an account?
bn: অ্যাকাউন্ট নেই?

# registerLink
source: Register
bn: রেজিস্টার করুন

# loginSuccess
source: Login successful!
bn: সফলভাবে লগইন হয়েছে!

# loginError
source: Phone number and password required
bn: ফোন নম্বর এবং পাসওয়ার্ড দিন

# stepDate
source: Date Selection
bn: তারিখ নির্বাচন

# stepGuest
source: Guest Info
bn: অতিথি তথ্য

# stepPayment
source: Payment
bn: পেমেন্ট

# datesLabel
source: Check-in & Check-out Date
bn: চেক-ইন ও চেক-আউট তারিখ

# guestNameLabel
source: Guest Name
bn: অতিথির নাম

# guestNameHint
source: Enter full name
bn: পুরো নাম লিখুন

# guestPhoneLabel
source: Phone Number
bn: ফোন নম্বর

# guestEmailLabel
source: Email (Optional)
bn: ইমেইল (ঐচ্ছিক)

# guestCountLabel
source: Number of Guests
bn: অতিথি সংখ্যা

# maxGuestsLabel
source: Max 4 people
bn: সর্বোচ্চ ৪ জন

source: Room Rent
bn: রুম ভাড়া

source: Tax
bn: ট্যাক্স

source: Total
bn: মোট

# advancePaymentMessage
source: Pay only 20% advance now: {amount}
bn: এখন শুধু ২০% অগ্রিম: {amount}

source: Payment Method
bn: পেমেন্ট মেথড

source: Pay at Hotel
bn: হোটেলে পেমেন্ট

# payAtHotelSubtitle
source: Pay 20% now, rest at hotel
bn: শুধু ২০% অগ্রিম, বাকি হোটেলে

source: bKash
bn: বিকাশ

# bkashSubtitle
source: Full payment now
bn: সম্পূর্ণ পেমেন্ট এখনই

source: Nagad
bn: নগদ

# nagadSubtitle
source: Full payment now
bn: সম্পূর্ণ পেমেন্ট এখনই

source: Card
bn: কার্ড

# cardSubtitle
source: Credit/Debit Card
bn: ক্রেডিট/ডেবিট কার্ড

# bookingSuccessTitle
source: Booking Confirmed!
bn: বুকিং সম্পন্ন!

# bookingSuccessMessage
source: Your booking has been successfully confirmed.
bn: আপনার বুকিং সফলভাবে সম্পন্ন হয়েছে।

source: View My Bookings
bn: আমার বুকিং দেখুন

# bookingError
source: Failed to book. Please try again.
bn: বুকিং করতে সমস্যা হয়েছে। পুনরায় চেষ্টা করুন।

# detailsAbout
source: About Hotel
bn: হোটেল সম্পর্কে

# detailsAmenities
source: Amenities
bn: সুবিধাসমূহ

# detailsDescription
source: Description
bn: বিবরণ

# detailsRooms
source: Available Rooms
bn: উপলব্ধ রুম

source: Select Room
bn: রুম নির্বাচন করুন

source: night
bn: রাত

# selectDateMessage
source: Please select dates
bn: তারিখ নির্বাচন করুন

# checkoutDateMessage
source: Check-out date must be after check-in date
bn: চেক-আউট তারিখ চেক-ইনের পরে হতে হবে

# enterGuestNameMessage
source: Please enter guest name
bn: অতিথির নাম লিখুন

# enterPhoneMessage
source: Please enter phone number
bn: ফোন নম্বর লিখুন

source: Next
bn: পরবর্তী

source: Previous
bn: পূর্ববর্তী

# shareHotelText
source: Check out this hotel: {hotelName} - {link}
bn: এই হোটেলটি দেখুন: {hotelName} - {link}

# hotelDetailsTitle
source: Hotel Details
bn: হোটেল বিস্তারিত

# roomsCount
source: {count} rooms
bn: {count} টি রুম

source: Error loading rooms
bn: রুম লোড করতে সমস্যা হয়েছে

source: No rooms found
bn: কোনো রুম পাওয়া যায়নি

# selectRoomSnackbar
source: Please scroll up to select a room
bn: উপরে স্ক্রল করে রুম নির্বাচন করুন

source: Error loading hotel
bn: হোটেল লোড করতে সমস্যা হয়েছে

# capacityText
source: {count} Guests
bn: {count} জন

# bedDouble
source: 1 Double Bed
bn: ১ ডাবল বেড

# bedTwin
source: 2 Single Beds
bn: ২ সিঙ্গেল বেড

# bedSingle
source: 1 Single Bed
bn: ১ সিঙ্গেল বেড

# bedDefault
source: 1 Bed
bn: ১ বেড

source: Good Morning
bn: সুপ্রভাত

source: Good Afternoon
bn: শুভ দুপুর

source: Good Evening
bn: শুভ সন্ধ্যা

source: Good Night
bn: শুভ রাত্রি

source: Flash Deals
bn: ফ্ল্যাশ ডিল

source: Booking
bn: বুকিং

source: Booking Details
bn: বুকিং বিবরণ

source: Confirmed
bn: নিশ্চিত হয়েছে

source: Pending
bn: অপেক্ষমাণ

source: Payment
bn: পেমেন্ট

source: nights
bn: রাত

source: Check-in QR Code
bn: চেক-ইন QR কোড

# showQRAtReception
source: Show this code at reception
bn: রিসেপশনে এই কোড দেখান

source: Call Hotel
bn: হোটেলে কল

source: View on Map
bn: ম্যাপে দেখুন

source: Cancel Booking
bn: বুকিং বাতিল করুন

# cancelBookingQuestion
source: Cancel this booking?
bn: বুকিং বাতিল করবেন?

# cancelBookingMessage
source: Cancellation 24 hours before check-in is free. Less than 24 hours may incur charges.
bn: চেক-ইনের ২৪ ঘণ্টা আগে বাতিল করলে কোনো চার্জ কাটা হবে না।

source: No
bn: না

# yesCancelBooking
source: Yes, Cancel
bn: হ্যাঁ, বাতিল করুন

source: Error loading booking
bn: বুকিং লোড করতে সমস্যা হয়েছে

source: Booking not found
bn: বুকিং পাওয়া যায়নি
